{
    "name": "ISO 27001",
    "framework": "iso27001",
    "version": "2022",
    "web_link": "https://www.iso.org/standard/27001",
    "controls": [
        {
            "name": "Organization Controls",
            "description": "Information security policies",
            "ref_code": "A.5",
            "category": "Organization Controls",
            "sub_controls": [
                {
                    "name": "Policies for information security",
                    "description": "Information security policy and topic-specific policies shall be defined, approved by management, published, communicated to and acknowledged by relevant personnel and relevant interested parties, and reviewed at planned intervals and if significant changes occur.",
                    "ref_code": "A.5.1",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security roles and responsibilities",
                    "description": "Information security roles and responsibilities shall be defined and allocated according to the organization needs.",
                    "ref_code": "A.5.2",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Segregation of duties",
                    "description": "Conflicting duties and conflicting areas of responsibility shall be segregated.",
                    "ref_code": "A.5.3",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Management responsibilities",
                    "description": "Management shall require all personnel to apply information security in accordance with the established information security policy, topic-specific policies and procedures of the organization.",
                    "ref_code": "A.5.4",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": " Contact with authorities",
                    "description": "The organization shall establish and maintain contact with relevant authorities.",
                    "ref_code": "A.5.5",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": " Contact with special interest groups",
                    "description": "The organization shall establish and maintain contact with special interest groups or other specialist security forums and professional associations.",
                    "ref_code": "A.5.6",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Threat intelligence",
                    "description": "Information relating to information security threats shall be collected and analysed to produce threat intelligence.",
                    "ref_code": "A.5.7",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security in project management",
                    "description": "Information security shall be integrated into project management.",
                    "ref_code": "A.5.8",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security in project management",
                    "description": "An inventory of information and other associated assets, including owners, shall be developed and maintained.",
                    "ref_code": "A.5.9",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Acceptable use of information and other associated assets",
                    "description": "Rules for the acceptable use and procedures for handling information and other associated assets shall be identified, documented and implemented.",
                    "ref_code": "A.5.10",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Acceptable use of information and other associated assets",
                    "description": "Rules for the acceptable use and procedures for handling information and other associated assets shall be identified, documented and implemented.",
                    "ref_code": "A.5.11",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Classification of information",
                    "description": "Information shall be classified according to the information security needs of the organization based on confidentiality, integrity, availability and relevant interested party requirements.",
                    "ref_code": "A.5.12",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Labelling of information",
                    "description": "An appropriate set of procedures for information labelling shall be developed and implemented in accordance with the information classification scheme adopted by the organization.",
                    "ref_code": "A.5.13",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information transfer",
                    "description": "Information transfer rules, procedures, or agreements shall be in place for all types of transfer facilities within the organization and between the organization and other parties.",
                    "ref_code": "A.5.14",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Access control",
                    "description": "Rules to control physical and logical access to information and other associated assets shall be established and implemented based on business and information security requirements.",
                    "ref_code": "A.5.15",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Identity management",
                    "description": "The full life cycle of identities shall be managed.",
                    "ref_code": "A.5.16",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Authentication information",
                    "description": "Allocation and management of authentication information shall be controlled by a management process, including advising personnel on appropriate handling of authentication information.",
                    "ref_code": "A.5.17",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Access rights",
                    "description": "Access rights to information and other associated assets shall be provisioned, reviewed, modified and removed in accordance with the organization’s topic-specific policy on and rules for access control.",
                    "ref_code": "A.5.18",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security in supplier relationships",
                    "description": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the use of supplier’s products or services.",
                    "ref_code": "A.5.19",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Addressing information security within supplier agreements",
                    "description": "Relevant information security requirements shall be established and agreed with each supplier based on the type of supplier relationship.",
                    "ref_code": "A.5.20",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Managing information security in the information and communication technology (ICT) supply chain",
                    "description": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the ICT products and services supply chain.",
                    "ref_code": "A.5.21",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Monitoring, review and change management of supplier services",
                    "description": "The organization shall regularly monitor, review, evaluate and manage change in supplier information security practices and service delivery.",
                    "ref_code": "A.5.22",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security for use of cloud services",
                    "description": "Processes for acquisition, use, management and exit from cloud services shall be established in accordance with the organization’s information security requirements.",
                    "ref_code": "A.5.23",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security incident management planning and preparation",
                    "description": "The organization shall plan and prepare for managing information security incidents by defining, establishing and communicating information security incident management processes, roles and responsibilities.",
                    "ref_code": "A.5.24",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Assessment and decision on information security events",
                    "description": "The organization shall assess information security events and decide if they are to be categorized as information security incidents.",
                    "ref_code": "A.5.25",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Response to information security incidents",
                    "description": "Information security incidents shall be responded to in accordance with the documented procedures.",
                    "ref_code": "A.5.26",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Learning from information security incidents",
                    "description": "Knowledge gained from information security incidents shall be used to strengthen and improve the information security controls.",
                    "ref_code": "A.5.27",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Collection of evidence",
                    "description": "The organization shall establish and implement procedures for the identification, collection, acquisition and preservation of evidence related to information security events.",
                    "ref_code": "A.5.28",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security during disruption",
                    "description": "The organization shall plan how to maintain information security at an appropriate level during disruption.",
                    "ref_code": "A.5.29",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "ICT readiness for business continuity",
                    "description": "ICT readiness shall be planned, implemented, maintained and tested based on business continuity objectives and ICT continuity requirements.",
                    "ref_code": "A.5.30",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Legal, statutory, regulatory and contractual requirements",
                    "description": "Legal, statutory, regulatory and contractual requirements relevant to information security and the organization’s approach to meet these requirements shall be identified, documented and kept up to date.",
                    "ref_code": "A.5.31",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Intellectual property rights",
                    "description": "The organization shall implement appropriate procedures to protect intellectual property rights.",
                    "ref_code": "A.5.32",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Protection of records",
                    "description": "Records shall be protected from loss, destruction, falsification, unauthorized access and unauthorized release.",
                    "ref_code": "A.5.33",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Privacy and protection of personal identifiable information (PII)",
                    "description": "The organization shall identify and meet the requirements regarding the preservation of privacy and protection of PII according to applicable laws and regulations and contractual requirements.",
                    "ref_code": "A.5.34",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Independent review of information security",
                    "description": "The organization’s approach to managing information security and its implementation including people, processes and technologies shall be reviewed independently at planned intervals, or when significant changes occur",
                    "ref_code": "A.5.35",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Compliance with policies, rules and standards for information security",
                    "description": "Compliance with the organization’s information security policy, topic-specific policies, rules and standards shall be regularly reviewed.",
                    "ref_code": "A.5.36",
                    "category": "Organization Controls",
                    "metadata": {}
                },
                {
                    "name": "Documented operating procedures",
                    "description": "Operating procedures for information processing facilities shall be documented and made available to personnel who need them.",
                    "ref_code": "A.5.37",
                    "category": "Organization Controls",
                    "metadata": {}
                }
            ],
            "metadata": {}
        },
        {
            "name": "People Controls",
            "description": "People controls",
            "ref_code": "A.6",
            "category": "People Controls",
            "sub_controls": [
                {
                    "name": "Screening",
                    "description": "Background verification checks on all candidates to become personnelshall be carried out prior to joining the organization and on an ongoing basis taking into consideration applicable laws, regulations and ethics and be proportional to the business requirements, the classification of the information to be accessed and the perceived risks.",
                    "ref_code": "A.6.1",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Terms and conditions of employment",
                    "description": "The employment contractual agreements shall state the personnel’s and the organization’s responsibilities for information security.",
                    "ref_code": "A.6.2",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security awareness, education and training",
                    "description": "Personnel of the organization and relevant interested parties shall receive appropriate information security awareness, education and training and regular updates of the organization's information security policy, topic-specific policies and procedures, as relevant for their job function.",
                    "ref_code": "A.6.3",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Disciplinary process",
                    "description": "A disciplinary process shall be formalized and communicated to take actions against personnel and other relevant interested parties who have committed an information security policy violation.",
                    "ref_code": "A.6.4",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Responsibilities after termination or change of employment",
                    "description": "Information security responsibilities and duties that remain valid after termination or change of employment shall be defined, enforced and communicated to relevant personnel and other interested parties.",
                    "ref_code": "A.6.5",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Confidentiality or non-disclosure agreements",
                    "description": "Confidentiality or non-disclosure agreements reflecting the organization’s needs for the protection of information shall be identified,documented, regularly reviewed and signed by personnel and other relevant interested parties.",
                    "ref_code": "A.6.6",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Remote working",
                    "description": "Security measures shall be implemented when personnel are working remotely to protect information accessed, processed or stored outside the organization’s premises.",
                    "ref_code": "A.6.7",
                    "category": "People Controls",
                    "metadata": {}
                },
                {
                    "name": "Information security event reporting",
                    "description": "The organization shall provide a mechanism for personnel to report observed or suspected information security events through appropriate channels in a timely manner.",
                    "ref_code": "A.6.8",
                    "category": "People Controls",
                    "metadata": {}
                }
            ],
            "metadata": {}
        },
        {
            "name": "Physical Controls",
            "description": "Physical controls",
            "ref_code": "A.7",
            "category": "Physical Controls",
            "sub_controls": [
                {
                    "name": "Physical security perimeters",
                    "description": "Security perimeters shall be defined and used to protect areas that contain information and other associated assets.",
                    "ref_code": "A.7.1",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Physical entry",
                    "description": "Secure areas shall be protected by appropriate entry controls and access points.",
                    "ref_code": "A.7.2",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Securing offices, rooms and facilities",
                    "description": "Physical security for offices, rooms and facilities shall be designed and implemented.",
                    "ref_code": "A.7.3",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Physical security monitoring",
                    "description": "Premises shall be continuously monitored for unauthorized physical access.",
                    "ref_code": "A.7.4",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Protecting against physical and environmental threats",
                    "description": "Protection against physical and environmental threats, such as natural disasters and other intentional or unintentional physical threats to infrastructure shall be designed and implemented.",
                    "ref_code": "A.7.5",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Working in secure areas",
                    "description": "Security measures for working in secure areas shall be designed and implemented.",
                    "ref_code": "A.7.6",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Clear desk and clear screen",
                    "description": "Clear desk rules for papers and removable storage media and clear screen rules for information processing facilities shall be defined and appropriately enforced.",
                    "ref_code": "A.7.7",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Equipment siting and protection",
                    "description": "Equipment shall be sited securely and protected.",
                    "ref_code": "A.7.8",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Security of assets off-premises",
                    "description": "Off-site assets shall be protected.",
                    "ref_code": "A.7.9",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Storage media",
                    "description": "Storage media shall be managed through their life cycle of acquisition, use, transportation and disposal in accordance with the organization’s classification scheme and handling requirements.",
                    "ref_code": "A.7.10",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Supporting utilities",
                    "description": "Information processing facilities shall be protected from power failures and other disruptions caused by failures in supporting utilities.",
                    "ref_code": "A.7.11",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Cabling security",
                    "description": "Cables carrying power, data or supporting information services shall be protected from interception, interference or damage.",
                    "ref_code": "A.7.12",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Equipment maintenance",
                    "description": "Equipment shall be maintained correctly to ensure availability, integrity and confidentiality of information.",
                    "ref_code": "A.7.13",
                    "category": "Physical Controls",
                    "metadata": {}
                },
                {
                    "name": "Secure disposal or re-use of equipment",
                    "description": "Items of equipment containing storage media shall be verified to ensure that any sensitive data and licensed software has been removed or securely overwritten prior to disposal or re-use.",
                    "ref_code": "A.7.14",
                    "category": "Physical Controls",
                    "metadata": {}
                }
            ],
            "metadata": {}
        },
        {
            "name": "Technology Controls",
            "description": "Technological controls",
            "ref_code": "A.8",
            "category": "Technology Controls",
            "sub_controls": [
                {
                    "name": "User end point devices",
                    "description": "Information stored on, processed by or accessible via user end point devices shall be protected.",
                    "ref_code": "A.8.1",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Privileged access rights",
                    "description": "The allocation and use of privileged access rights shall be restricted and managed.",
                    "ref_code": "A.8.2",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Information access restriction",
                    "description": "Access to information and other associated assets shall be restricted in accordance with the established topic-specific policy on access control.",
                    "ref_code": "A.8.3",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Access to source code",
                    "description": "Read and write access to source code, development tools and software libraries shall be appropriately managed.",
                    "ref_code": "A.8.4",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Secure authentication",
                    "description": "Secure authentication technologies and procedures shall be implemented based on information access restrictions and the topic-specific policy on access control.",
                    "ref_code": "A.8.5",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Capacity management",
                    "description": "The use of resources shall be monitored and adjusted in line with current and expected capacity requirements.",
                    "ref_code": "A.8.6",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Protection against malware",
                    "description": "Protection against malware shall be implemented and supported by appropriate user awareness.",
                    "ref_code": "A.8.7",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Management of technical vulnerabilities",
                    "description": "Information about technical vulnerabilities of information systems in use shall be obtained, the organization’s exposure to such vulnerabilities shall be evaluated and appropriate measures shall be taken.",
                    "ref_code": "A.8.8",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Configuration management",
                    "description": "Configurations, including security configurations, of hardware, software, services and networks shall be established, documented, implemented, monitored and reviewed.",
                    "ref_code": "A.8.9",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Information deletion",
                    "description": "Information stored in information systems, devices or in any other storage media shall be deleted when no longer required.",
                    "ref_code": "A.8.10",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Data masking",
                    "description": "Data masking shall be used in accordance with the organization’s topic-specific policy on access control and other related topic-specific policies, and business requirements, taking applicable legislation into consideration.",
                    "ref_code": "A.8.11",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Data leakage prevention",
                    "description": "Data leakage prevention measures shall be applied to systems, networks and any other devices that process, store or transmit sensitive information.",
                    "ref_code": "A.8.12",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Information backup",
                    "description": "Backup copies of information, software and systems shall be maintained and regularly tested in accordance with the agreed topic-specific policy on backup.",
                    "ref_code": "A.8.13",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Redundancy of information processing facilities",
                    "description": "Information processing facilities shall be implemented with redundancy sufficient to meet availability requirements.",
                    "ref_code": "A.8.14",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Logging",
                    "description": "Logs that record activities, exceptions, faults and other relevant events shall be produced, stored, protected and analysed.",
                    "ref_code": "A.8.15",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Monitoring activities",
                    "description": "Networks, systems and applications shall be monitored for anomalous behaviour and appropriate actions taken to evaluate potential information security incidents.",
                    "ref_code": "A.8.16",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Clock synchronization",
                    "description": "The clocks of information processing systems used by the organization shall be synchronized to approved time sources.",
                    "ref_code": "A.8.17",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Use of privileged utility programs",
                    "description": "The use of utility programs that can be capable of overriding system and application controls shall be restricted and tightly controlled.",
                    "ref_code": "A.8.18",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Installation of software on operational systems",
                    "description": "Procedures and measures shall be implemented to securely manage software installation on operational systems.",
                    "ref_code": "A.8.19",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Networks security",
                    "description": "Networks and network devices shall be secured, managed and controlled to protect information in systems and applications.",
                    "ref_code": "A.8.20",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Security of network services",
                    "description": "Security mechanisms, service levels and service requirements of network services shall be identified, implemented and monitored.",
                    "ref_code": "A.8.21",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Segregation of networks",
                    "description": "Groups of information services, users and information systems shall be segregated in the organization’s networks.",
                    "ref_code": "A.8.22",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Web filtering",
                    "description": "Access to external websites shall be managed to reduce exposure to malicious content.",
                    "ref_code": "A.8.23",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Use of cryptography",
                    "description": "Rules for the effective use of cryptography, including cryptographic key management, shall be defined and implemented.",
                    "ref_code": "A.8.24",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Secure development life cycle",
                    "description": "Rules for the secure development of software and systems shall be established and applied.",
                    "ref_code": "A.8.25",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Application security requirements",
                    "description": "Information security requirements shall be identified, specified and approved when developing or acquiring applications",
                    "ref_code": "A.8.26",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Secure system architecture and engineering principles",
                    "description": "Principles for engineering secure systems shall be established, documented, maintained and applied to any information system development activities.",
                    "ref_code": "A.8.27",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Secure coding",
                    "description": "Secure coding principles shall be applied to software development.",
                    "ref_code": "A.8.28",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Security testing in development and acceptance",
                    "description": "Security testing processes shall be defined and implemented in the development life cycle.",
                    "ref_code": "A.8.29",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Outsourced development",
                    "description": "The organization shall direct, monitor and review the activities related to outsourced system development.",
                    "ref_code": "A.8.30",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Separation of development, test and production environments",
                    "description": "Development, testing and production environments shall be separated and secured.",
                    "ref_code": "A.8.31",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Change management",
                    "description": "Changes to information processing facilities and information systems shall be subject to change management procedures.",
                    "ref_code": "A.8.32",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Test information",
                    "description": "Test information shall be appropriately selected, protected and managed.",
                    "ref_code": "A.8.33",
                    "category": "Technology Controls",
                    "metadata": {}
                },
                {
                    "name": "Protection of information systems during audit testing",
                    "description": "Audit tests and other assurance activities involving assessment of operational systems shall be planned and agreed between the tester and appropriate management.",
                    "ref_code": "A.8.34",
                    "category": "Technology Controls",
                    "metadata": {}
                }
            ],
            "metadata": {}
        }
    ]
}